// "use srtict"

// Задача №1
// Що потрапить в консоль?

// let someVar = 0
// ++someVar

// if (someVar) {
// 	console.log(someVar) // відповідь 1
// }
// Розв'язок
// Оскільки змінна збільшується інкрементом на 1  "++someVar"  то після перевірки умови отримаємо в консолі  1
//

// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.
// Розв'язок
// for (let i = 1; i <= 10; ++i) {
// 	const someString = `Пункт №${i}`
// 	console.log(someString)
// }

// Задача №3
// Що потрапить в консоль ?
// if (2 * 20 <= 10 || (30 / 2 < 5 && 10 <= "10") || 20 === "20") {
// 	console.log("000")
// }
// Розв'язок
// Оскільки, оператор ||"або" повертає перше true, а в нашій умові всі умови в конструкції є false то в консоль не буде виведено "000"

// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку

// Розв'язок
// function division(a, b) {
// 	let c = a / b
// 	if (c && c !== Infinity) {
// 		console.log(`Результат ділення: ${c}`)
// 	} else {
// 		console.log(`Невірні дані!`)
// 	}
// }
// division(25, 10)

// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль
// const givenArray = ["banana", 10, "10", true, NaN]
// givenArray.forEach((el) => console.log(el))
// if (givenArray.includes(10)) {
// 	console.log(`Ось воно ${10}`)
// } else {
// 	console.log("Немає такого")
// }

// ====================================
const buttonTogle = document.querySelector(".page__button")

buttonTogle.addEventListener("click", () => {
	document.documentElement.classList.toggle("show")
})
